uhnp/src/InformationRegisters/ПараметрыЛимитированияГруппыСтатейСостав/ПараметрыЛимитированияГруппыСтатейСостав.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЛимитированияГруппыСтатейСостав</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ГруппаСтатей</name>
    <type>
      <types>CatalogRef.ГруппыСтатейБюджета</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПараметрыЛимитированияГруппыСтатейСостав/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Устанавливает параметры лимитирования группы статей состав
//
// Параметры:
//  ВидБюджета		 - ПланВидовХарактеристикСсылка.ВидыБюджетов	 - Ссылка на вид бюджета по которому устанавливается контроль
//  СтатьяБюджета	 - Характеристика.ВидыБюджетов	 - Ссылка на статью бюджета
//  Период			 - Дата	 - Дата 
//
Процедура ВыполнитьУстановкуПараметрыЛимитированияГруппыСтатей(ВидБюджета, СтатьяБюджета, Период, ГруппаСтатей) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПараметрыЛимитированияГруппыСтатейСостав");
	ЭлементБлокировки.УстановитьЗначение("Период", 			Период);
	ЭлементБлокировки.УстановитьЗначение("ВидБюджета", 		ВидБюджета);
	ЭлементБлокировки.УстановитьЗначение("СтатьяБюджета", 	СтатьяБюджета);
	
	НаборЗаписей = РегистрыСведений.ПараметрыЛимитированияГруппыСтатейСостав.СоздатьНаборЗаписей();
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка.Заблокировать();
		НаборЗаписей.Отбор.ВидБюджета.Установить(ВидБюджета);
		НаборЗаписей.Отбор.Период.Установить(Период);
		НаборЗаписей.Отбор.СтатьяБюджета.Установить(СтатьяБюджета);
		
		Если ЗначениеЗаполнено(ГруппаСтатей) Тогда
			Движение = НаборЗаписей.Добавить();
			Движение.ВидБюджета = ВидБюджета;
			Движение.Период = Период;
			Движение.СтатьяБюджета 	= СтатьяБюджета;
			Движение.ГруппаСтатей 	= ГруппаСтатей;   
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
		ЗафиксироватьТранзакцию();    		
				
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
